; domain
(define (domain miconic)
(:requirements :strips :typing :negative-preconditions)
(:types
floor passenger - object
)
(:predicates
	(lift-at ?x1 - floor)
	(boarded ?x1 - passenger)
	(served ?x1 - passenger)
	(above ?x1 - floor ?x2 - floor)
	(origin ?x1 - passenger ?x2 - floor)
	(destin ?x1 - passenger ?x2 - floor)
)
(:action board
	:parameters (?x1 - floor ?x2 - passenger )
	:precondition (and
	(not(boarded ?x2))
	(not(served ?x2))
	(lift-at ?x1)
	(origin ?x2 ?x1))
	:effect (and
	(boarded ?x2))
)
(:action depart
	:parameters (?x1 - floor ?x2 - passenger )
	:precondition (and
	(boarded ?x2)
	(not(served ?x2))
	(lift-at ?x1)
	(destin ?x2 ?x1))
	:effect (and
	(not(boarded ?x2))
	(served ?x2))
)
(:action up
	:parameters (?x1 - floor ?x2 - floor )
	:precondition (and
	(not(lift-at ?x2))
	(above ?x1 ?x2)
	(lift-at ?x1))
	:effect (and
	(lift-at ?x2)
	(not(lift-at ?x1)))
)
(:action down
	:parameters (?x1 - floor ?x2 - floor )
	:precondition (and
	(not(lift-at ?x2))
	(lift-at ?x1)
	(above ?x2 ?x1))
	:effect (and
	(lift-at ?x2)
	(not(lift-at ?x1)))
)
)

; problem
(define (problem mixed-f14-p7-u0-v0-g0-a0-n0-A0-B0-N0-F0-r0)
   (:domain miconic)
   (:objects p0 p1 p2 p3 p4 p5 p6 - passenger
             f0 f1 f2 f3 f4 f5 f6 f7 f8 f9 
             f10 f11 f12 f13 - floor)


(:init

(above f0 f1)
(above f0 f2)
(above f0 f3)
(above f0 f4)
(above f0 f5)
(above f0 f6)
(above f0 f7)
(above f0 f8)
(above f0 f9)
(above f0 f10)
(above f0 f11)
(above f0 f12)
(above f0 f13)

(above f1 f2)
(above f1 f3)
(above f1 f4)
(above f1 f5)
(above f1 f6)
(above f1 f7)
(above f1 f8)
(above f1 f9)
(above f1 f10)
(above f1 f11)
(above f1 f12)
(above f1 f13)

(above f2 f3)
(above f2 f4)
(above f2 f5)
(above f2 f6)
(above f2 f7)
(above f2 f8)
(above f2 f9)
(above f2 f10)
(above f2 f11)
(above f2 f12)
(above f2 f13)

(above f3 f4)
(above f3 f5)
(above f3 f6)
(above f3 f7)
(above f3 f8)
(above f3 f9)
(above f3 f10)
(above f3 f11)
(above f3 f12)
(above f3 f13)

(above f4 f5)
(above f4 f6)
(above f4 f7)
(above f4 f8)
(above f4 f9)
(above f4 f10)
(above f4 f11)
(above f4 f12)
(above f4 f13)

(above f5 f6)
(above f5 f7)
(above f5 f8)
(above f5 f9)
(above f5 f10)
(above f5 f11)
(above f5 f12)
(above f5 f13)

(above f6 f7)
(above f6 f8)
(above f6 f9)
(above f6 f10)
(above f6 f11)
(above f6 f12)
(above f6 f13)

(above f7 f8)
(above f7 f9)
(above f7 f10)
(above f7 f11)
(above f7 f12)
(above f7 f13)

(above f8 f9)
(above f8 f10)
(above f8 f11)
(above f8 f12)
(above f8 f13)

(above f9 f10)
(above f9 f11)
(above f9 f12)
(above f9 f13)

(above f10 f11)
(above f10 f12)
(above f10 f13)

(above f11 f12)
(above f11 f13)

(above f12 f13)



(origin p0 f1)
(destin p0 f4)

(origin p1 f9)
(destin p1 f5)

(origin p2 f1)
(destin p2 f3)

(origin p3 f10)
(destin p3 f2)

(origin p4 f1)
(destin p4 f3)

(origin p5 f2)
(destin p5 f5)

(origin p6 f6)
(destin p6 f11)






(lift-at f0)
)


(:goal (and 
(served p0)
(served p1)
(served p2)
(served p3)
(served p4)
(served p5)
(served p6)
))
)

; plan
1. (up f0 f1)
   deleted: (lift-at f0)
   added: (lift-at f1)
   goals met: 0 of 7
2. (board f1 p4)
   added: (boarded p4)
   goals met: 0 of 7
3. (board f1 p2)
   added: (boarded p2)
   goals met: 0 of 7
4. (board f1 p0)
   added: (boarded p0)
   goals met: 0 of 7
5. (up f1 f10)
   deleted: (lift-at f1)
   added: (lift-at f10)
   goals met: 0 of 7
6. (board f10 p3)
   added: (boarded p3)
   goals met: 0 of 7
7. (down f10 f2)
   deleted: (lift-at f10)
   added: (lift-at f2)
   goals met: 0 of 7
8. (board f2 p5)
   added: (boarded p5)
   goals met: 0 of 7
9. (depart f2 p3)
   deleted: (boarded p3)
   added: (served p3)
   goals met: 1 of 7
10. (up f2 f11)
   deleted: (lift-at f2)
   added: (lift-at f11)
   goals met: 1 of 7
11. (down f11 f3)
   deleted: (lift-at f11)
   added: (lift-at f3)
   goals met: 1 of 7
12. (depart f3 p4)
   deleted: (boarded p4)
   added: (served p4)
   goals met: 2 of 7
13. (depart f3 p2)
   deleted: (boarded p2)
   added: (served p2)
   goals met: 3 of 7
14. (up f3 f11)
   deleted: (lift-at f3)
   added: (lift-at f11)
   goals met: 3 of 7
15. (down f11 f4)
   deleted: (lift-at f11)
   added: (lift-at f4)
   goals met: 3 of 7
16. (depart f4 p0)
   deleted: (boarded p0)
   added: (served p0)
   goals met: 4 of 7
17. (up f4 f11)
   deleted: (lift-at f4)
   added: (lift-at f11)
   goals met: 4 of 7
18. (down f11 f5)
   deleted: (lift-at f11)
   added: (lift-at f5)
   goals met: 4 of 7
19. (depart f5 p5)
   deleted: (boarded p5)
   added: (served p5)
   goals met: 5 of 7
20. (up f5 f6)
   deleted: (lift-at f5)
   added: (lift-at f6)
   goals met: 5 of 7
21. (board f6 p6)
   added: (boarded p6)
   goals met: 5 of 7
22. (down f6 f5)
   deleted: (lift-at f6)
   added: (lift-at f5)
   goals met: 5 of 7
23. (up f5 f11)
   deleted: (lift-at f5)
   added: (lift-at f11)
   goals met: 5 of 7
24. (depart f11 p6)
   deleted: (boarded p6)
   added: (served p6)
   goals met: 6 of 7
25. (down f11 f5)
   deleted: (lift-at f11)
   added: (lift-at f5)
   goals met: 6 of 7
26. (up f5 f9)
   deleted: (lift-at f5)
   added: (lift-at f9)
   goals met: 6 of 7
27. (board f9 p1)
   added: (boarded p1)
   goals met: 6 of 7
28. (down f9 f5)
   deleted: (lift-at f9)
   added: (lift-at f5)
   goals met: 6 of 7
29. (depart f5 p1)
   deleted: (boarded p1)
   added: (served p1)
   goals met: 7 of 7
